{
    "metadata": {
        "total_size": 155095475292,
        "total_parameters": 284333146519
    },
    "weight_map": {
        "lm_head.biases": "model-00033-of-00033.safetensors",
        "lm_head.scales": "model-00033-of-00033.safetensors",
        "lm_head.weight": "model-00033-of-00033.safetensors",
        "model.embed_tokens.biases": "model-00001-of-00033.safetensors",
        "model.embed_tokens.scales": "model-00001-of-00033.safetensors",
        "model.embed_tokens.weight": "model-00001-of-00033.safetensors",
        "model.hc_head.base": "model-00033-of-00033.safetensors",
        "model.hc_head.fn": "model-00033-of-00033.safetensors",
        "model.hc_head.scale": "model-00033-of-00033.safetensors",
        "model.layers.0.attn.attn_sink": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.kv_norm.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.q_norm.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wkv.biases": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wkv.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wkv.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wo_a.biases": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wo_a.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wo_a.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wo_b.biases": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wo_b.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wo_b.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wq_a.biases": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wq_a.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wq_a.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wq_b.biases": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wq_b.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.attn.wq_b.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.attn_hc.base": "model-00001-of-00033.safetensors",
        "model.layers.0.attn_hc.fn": "model-00001-of-00033.safetensors",
        "model.layers.0.attn_hc.scale": "model-00001-of-00033.safetensors",
        "model.layers.0.attn_norm.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.gate.tid2eid": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.gate.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.down_proj.biases": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.down_proj.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.down_proj.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.gate_proj.biases": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.gate_proj.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.gate_proj.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.up_proj.biases": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.up_proj.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.shared_experts.up_proj.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.switch_mlp.down_proj.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.switch_mlp.down_proj.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.switch_mlp.gate_proj.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.switch_mlp.gate_proj.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.switch_mlp.up_proj.scales": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn.switch_mlp.up_proj.weight": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn_hc.base": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn_hc.fn": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn_hc.scale": "model-00001-of-00033.safetensors",
        "model.layers.0.ffn_norm.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.attn_sink": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.kv_norm.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.q_norm.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wkv.biases": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wkv.scales": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wkv.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wo_a.biases": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wo_a.scales": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wo_a.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wo_b.biases": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wo_b.scales": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wo_b.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wq_a.biases": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wq_a.scales": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wq_a.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wq_b.biases": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wq_b.scales": "model-00001-of-00033.safetensors",
        "model.layers.1.attn.wq_b.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.attn_hc.base": "model-00002-of-00033.safetensors",
        "model.layers.1.attn_hc.fn": "model-00002-of-00033.safetensors",
        "model.layers.1.attn_hc.scale": "model-00002-of-00033.safetensors",
        "model.layers.1.attn_norm.weight": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.gate.tid2eid": "model-00001-of-00033.safetensors",
        "model.layers.1.ffn.gate.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.down_proj.biases": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.down_proj.scales": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.down_proj.weight": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.gate_proj.biases": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.gate_proj.scales": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.gate_proj.weight": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.up_proj.biases": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.up_proj.scales": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.shared_experts.up_proj.weight": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.switch_mlp.down_proj.scales": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.switch_mlp.down_proj.weight": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.switch_mlp.gate_proj.scales": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.switch_mlp.gate_proj.weight": "model-00001-of-00033.safetensors",
        "model.layers.1.ffn.switch_mlp.up_proj.scales": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn.switch_mlp.up_proj.weight": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn_hc.base": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn_hc.fn": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn_hc.scale": "model-00002-of-00033.safetensors",
        "model.layers.1.ffn_norm.weight": "model-00002-of-00033.safetensors",
        "model.layers.10.attn.attn_sink": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.compressor.ape": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.compressor.norm.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.compressor.wgate.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.compressor.wgate.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.compressor.wgate.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.compressor.wkv.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.compressor.wkv.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.compressor.wkv.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.compressor.ape": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.compressor.norm.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.compressor.wgate.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.compressor.wgate.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.compressor.wgate.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.compressor.wkv.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.compressor.wkv.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.compressor.wkv.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.weights_proj.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.weights_proj.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.weights_proj.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.wq_b.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.wq_b.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.indexer.wq_b.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.kv_norm.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.q_norm.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wkv.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wkv.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wkv.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wo_a.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wo_a.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wo_a.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wo_b.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wo_b.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wo_b.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wq_a.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wq_a.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wq_a.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wq_b.biases": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wq_b.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.attn.wq_b.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.attn_hc.base": "model-00009-of-00033.safetensors",
        "model.layers.10.attn_hc.fn": "model-00009-of-00033.safetensors",
        "model.layers.10.attn_hc.scale": "model-00009-of-00033.safetensors",
        "model.layers.10.attn_norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.gate.e_score_correction_bias": "model-00008-of-00033.safetensors",
        "model.layers.10.ffn.gate.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.down_proj.biases": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.down_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.down_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.gate_proj.biases": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.gate_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.gate_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.up_proj.biases": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.up_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.shared_experts.up_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.switch_mlp.down_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.switch_mlp.down_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn.switch_mlp.gate_proj.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.ffn.switch_mlp.gate_proj.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.ffn.switch_mlp.up_proj.scales": "model-00008-of-00033.safetensors",
        "model.layers.10.ffn.switch_mlp.up_proj.weight": "model-00008-of-00033.safetensors",
        "model.layers.10.ffn_hc.base": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn_hc.fn": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn_hc.scale": "model-00009-of-00033.safetensors",
        "model.layers.10.ffn_norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.attn_sink": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.compressor.ape": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.compressor.norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.compressor.wgate.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.compressor.wgate.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.compressor.wgate.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.compressor.wkv.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.compressor.wkv.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.compressor.wkv.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.kv_norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.q_norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wkv.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wkv.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wkv.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wo_a.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wo_a.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wo_a.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wo_b.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wo_b.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wo_b.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wq_a.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wq_a.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wq_a.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wq_b.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wq_b.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.attn.wq_b.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.attn_hc.base": "model-00009-of-00033.safetensors",
        "model.layers.11.attn_hc.fn": "model-00009-of-00033.safetensors",
        "model.layers.11.attn_hc.scale": "model-00009-of-00033.safetensors",
        "model.layers.11.attn_norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.gate.e_score_correction_bias": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.gate.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.down_proj.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.down_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.down_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.gate_proj.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.gate_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.gate_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.up_proj.biases": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.up_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.shared_experts.up_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.switch_mlp.down_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.switch_mlp.down_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.switch_mlp.gate_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.switch_mlp.gate_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.switch_mlp.up_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn.switch_mlp.up_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn_hc.base": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn_hc.fn": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn_hc.scale": "model-00009-of-00033.safetensors",
        "model.layers.11.ffn_norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.attn_sink": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.compressor.ape": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.compressor.norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.compressor.wgate.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.compressor.wgate.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.compressor.wgate.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.compressor.wkv.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.compressor.wkv.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.compressor.wkv.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.compressor.ape": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.compressor.norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.compressor.wgate.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.compressor.wgate.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.compressor.wgate.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.compressor.wkv.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.compressor.wkv.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.compressor.wkv.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.weights_proj.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.weights_proj.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.weights_proj.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.wq_b.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.wq_b.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.indexer.wq_b.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.kv_norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.q_norm.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wkv.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wkv.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wkv.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wo_a.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wo_a.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wo_a.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wo_b.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wo_b.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wo_b.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wq_a.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wq_a.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wq_a.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wq_b.biases": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wq_b.scales": "model-00009-of-00033.safetensors",
        "model.layers.12.attn.wq_b.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.attn_hc.base": "model-00010-of-00033.safetensors",
        "model.layers.12.attn_hc.fn": "model-00010-of-00033.safetensors",
        "model.layers.12.attn_hc.scale": "model-00010-of-00033.safetensors",
        "model.layers.12.attn_norm.weight": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.gate.e_score_correction_bias": "model-00009-of-00033.safetensors",
        "model.layers.12.ffn.gate.weight": "model-00009-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.down_proj.biases": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.down_proj.scales": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.down_proj.weight": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.gate_proj.biases": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.gate_proj.scales": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.gate_proj.weight": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.up_proj.biases": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.up_proj.scales": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.shared_experts.up_proj.weight": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.switch_mlp.down_proj.scales": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.switch_mlp.down_proj.weight": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.switch_mlp.gate_proj.scales": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.switch_mlp.gate_proj.weight": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.switch_mlp.up_proj.scales": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn.switch_mlp.up_proj.weight": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn_hc.base": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn_hc.fn": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn_hc.scale": "model-00010-of-00033.safetensors",
        "model.layers.12.ffn_norm.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.attn_sink": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.compressor.ape": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.compressor.norm.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.compressor.wgate.biases": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.compressor.wgate.scales": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.compressor.wgate.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.compressor.wkv.biases": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.compressor.wkv.scales": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.compressor.wkv.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.kv_norm.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.q_norm.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wkv.biases": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wkv.scales": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wkv.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wo_a.biases": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wo_a.scales": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wo_a.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wo_b.biases": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wo_b.scales": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wo_b.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wq_a.biases": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wq_a.scales": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wq_a.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wq_b.biases": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wq_b.scales": "model-00010-of-00033.safetensors",
        "model.layers.13.attn.wq_b.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.attn_hc.base": "model-00011-of-00033.safetensors",
        "model.layers.13.attn_hc.fn": "model-00011-of-00033.safetensors",
        "model.layers.13.attn_hc.scale": "model-00011-of-00033.safetensors",
        "model.layers.13.attn_norm.weight": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.gate.e_score_correction_bias": "model-00010-of-00033.safetensors",
        "model.layers.13.ffn.gate.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.down_proj.biases": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.down_proj.scales": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.down_proj.weight": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.gate_proj.biases": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.gate_proj.scales": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.gate_proj.weight": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.up_proj.biases": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.up_proj.scales": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.shared_experts.up_proj.weight": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.switch_mlp.down_proj.scales": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.switch_mlp.down_proj.weight": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.switch_mlp.gate_proj.scales": "model-00010-of-00033.safetensors",
        "model.layers.13.ffn.switch_mlp.gate_proj.weight": "model-00010-of-00033.safetensors",
        "model.layers.13.ffn.switch_mlp.up_proj.scales": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn.switch_mlp.up_proj.weight": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn_hc.base": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn_hc.fn": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn_hc.scale": "model-00011-of-00033.safetensors",
        "model.layers.13.ffn_norm.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.attn_sink": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.compressor.ape": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.compressor.norm.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.compressor.wgate.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.compressor.wgate.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.compressor.wgate.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.compressor.wkv.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.compressor.wkv.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.compressor.wkv.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.compressor.ape": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.compressor.norm.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.compressor.wgate.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.compressor.wgate.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.compressor.wgate.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.compressor.wkv.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.compressor.wkv.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.compressor.wkv.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.weights_proj.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.weights_proj.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.weights_proj.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.wq_b.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.wq_b.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.indexer.wq_b.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.kv_norm.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.q_norm.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wkv.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wkv.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wkv.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wo_a.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wo_a.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wo_a.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wo_b.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wo_b.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wo_b.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wq_a.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wq_a.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wq_a.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wq_b.biases": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wq_b.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.attn.wq_b.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.attn_hc.base": "model-00012-of-00033.safetensors",
        "model.layers.14.attn_hc.fn": "model-00012-of-00033.safetensors",
        "model.layers.14.attn_hc.scale": "model-00012-of-00033.safetensors",
        "model.layers.14.attn_norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.gate.e_score_correction_bias": "model-00011-of-00033.safetensors",
        "model.layers.14.ffn.gate.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.down_proj.biases": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.down_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.down_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.gate_proj.biases": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.gate_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.gate_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.up_proj.biases": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.up_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.shared_experts.up_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.switch_mlp.down_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.switch_mlp.down_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn.switch_mlp.gate_proj.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.ffn.switch_mlp.gate_proj.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.ffn.switch_mlp.up_proj.scales": "model-00011-of-00033.safetensors",
        "model.layers.14.ffn.switch_mlp.up_proj.weight": "model-00011-of-00033.safetensors",
        "model.layers.14.ffn_hc.base": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn_hc.fn": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn_hc.scale": "model-00012-of-00033.safetensors",
        "model.layers.14.ffn_norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.attn_sink": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.compressor.ape": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.compressor.norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.compressor.wgate.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.compressor.wgate.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.compressor.wgate.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.compressor.wkv.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.compressor.wkv.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.compressor.wkv.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.kv_norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.q_norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wkv.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wkv.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wkv.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wo_a.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wo_a.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wo_a.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wo_b.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wo_b.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wo_b.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wq_a.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wq_a.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wq_a.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wq_b.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wq_b.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.attn.wq_b.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.attn_hc.base": "model-00012-of-00033.safetensors",
        "model.layers.15.attn_hc.fn": "model-00012-of-00033.safetensors",
        "model.layers.15.attn_hc.scale": "model-00012-of-00033.safetensors",
        "model.layers.15.attn_norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.gate.e_score_correction_bias": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.gate.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.down_proj.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.down_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.down_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.gate_proj.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.gate_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.gate_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.up_proj.biases": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.up_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.shared_experts.up_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.switch_mlp.down_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.switch_mlp.down_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.switch_mlp.gate_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.switch_mlp.gate_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.switch_mlp.up_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn.switch_mlp.up_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn_hc.base": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn_hc.fn": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn_hc.scale": "model-00012-of-00033.safetensors",
        "model.layers.15.ffn_norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.attn_sink": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.compressor.ape": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.compressor.norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.compressor.wgate.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.compressor.wgate.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.compressor.wgate.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.compressor.wkv.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.compressor.wkv.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.compressor.wkv.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.compressor.ape": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.compressor.norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.compressor.wgate.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.compressor.wgate.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.compressor.wgate.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.compressor.wkv.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.compressor.wkv.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.compressor.wkv.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.weights_proj.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.weights_proj.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.weights_proj.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.wq_b.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.wq_b.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.indexer.wq_b.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.kv_norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.q_norm.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wkv.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wkv.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wkv.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wo_a.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wo_a.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wo_a.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wo_b.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wo_b.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wo_b.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wq_a.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wq_a.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wq_a.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wq_b.biases": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wq_b.scales": "model-00012-of-00033.safetensors",
        "model.layers.16.attn.wq_b.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.attn_hc.base": "model-00013-of-00033.safetensors",
        "model.layers.16.attn_hc.fn": "model-00013-of-00033.safetensors",
        "model.layers.16.attn_hc.scale": "model-00013-of-00033.safetensors",
        "model.layers.16.attn_norm.weight": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.gate.e_score_correction_bias": "model-00012-of-00033.safetensors",
        "model.layers.16.ffn.gate.weight": "model-00012-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.down_proj.biases": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.down_proj.scales": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.down_proj.weight": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.gate_proj.biases": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.gate_proj.scales": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.gate_proj.weight": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.up_proj.biases": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.up_proj.scales": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.shared_experts.up_proj.weight": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.switch_mlp.down_proj.scales": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.switch_mlp.down_proj.weight": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.switch_mlp.gate_proj.scales": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.switch_mlp.gate_proj.weight": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.switch_mlp.up_proj.scales": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn.switch_mlp.up_proj.weight": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn_hc.base": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn_hc.fn": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn_hc.scale": "model-00013-of-00033.safetensors",
        "model.layers.16.ffn_norm.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.attn_sink": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.compressor.ape": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.compressor.norm.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.compressor.wgate.biases": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.compressor.wgate.scales": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.compressor.wgate.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.compressor.wkv.biases": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.compressor.wkv.scales": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.compressor.wkv.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.kv_norm.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.q_norm.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wkv.biases": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wkv.scales": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wkv.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wo_a.biases": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wo_a.scales": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wo_a.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wo_b.biases": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wo_b.scales": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wo_b.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wq_a.biases": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wq_a.scales": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wq_a.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wq_b.biases": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wq_b.scales": "model-00013-of-00033.safetensors",
        "model.layers.17.attn.wq_b.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.attn_hc.base": "model-00014-of-00033.safetensors",
        "model.layers.17.attn_hc.fn": "model-00014-of-00033.safetensors",
        "model.layers.17.attn_hc.scale": "model-00014-of-00033.safetensors",
        "model.layers.17.attn_norm.weight": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.gate.e_score_correction_bias": "model-00013-of-00033.safetensors",
        "model.layers.17.ffn.gate.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.down_proj.biases": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.down_proj.scales": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.down_proj.weight": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.gate_proj.biases": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.gate_proj.scales": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.gate_proj.weight": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.up_proj.biases": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.up_proj.scales": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.shared_experts.up_proj.weight": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.switch_mlp.down_proj.scales": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.switch_mlp.down_proj.weight": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.switch_mlp.gate_proj.scales": "model-00013-of-00033.safetensors",
        "model.layers.17.ffn.switch_mlp.gate_proj.weight": "model-00013-of-00033.safetensors",
        "model.layers.17.ffn.switch_mlp.up_proj.scales": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn.switch_mlp.up_proj.weight": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn_hc.base": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn_hc.fn": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn_hc.scale": "model-00014-of-00033.safetensors",
        "model.layers.17.ffn_norm.weight": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.attn_sink": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.compressor.ape": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.compressor.norm.weight": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.compressor.wgate.biases": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.compressor.wgate.scales": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.compressor.wgate.weight": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.compressor.wkv.biases": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.compressor.wkv.scales": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.compressor.wkv.weight": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.indexer.compressor.ape": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.indexer.compressor.norm.weight": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.indexer.compressor.wgate.biases": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.indexer.compressor.wgate.scales": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.indexer.compressor.wgate.weight": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.indexer.compressor.wkv.biases": "model-00014-of-00033.safetensors",
        "model.layers.18.attn.indexer.compressor.wkv.scales": "model-00014-of-00033.safetensors",
